
0x00=适用于所有操作正常返回
0x01=

/*错误代码编码分类*/
/*1 寻卡类错误*/
0x00100000=寻卡类错误

/*2 超时未读到卡错误*/
0x00140000=超时未读到卡
/*2 票卡读卡类错误*/
0x00050000=票卡读卡类错误
/*3 M1卡认证类错误*/
0x00200000=M1卡扇区认证
/*4 票卡写操作类错误*/
0x00060000=票卡写操作类错误
/*5 SAM卡处理公共类错误*/
0x00300000=SAM卡处理公共类错误
/*6 一卡通PSAM操作类错误*/  
0x00310000=一卡通PSAM操作类错误
/*7 一卡通ISAM操作类错误*/  
0x00320000=一卡通ISAM操作类错误
/*8 一票通PSAM操作类错误*/  
0x00330000=一票通PSAM操作类错误
/*9 一票通ISAM操作类错误*/  
0x00340000=一票通ISAM操作类错误
/*10 通讯接口类错误*/
0x00400000=通讯接口类错误
/*11 一票通业务处理类错误*/  
0x00500000=tj一票通业务处理类错误
/*12 一卡通业务处理类错误*/ 
0x00600000=一卡通业务处理类错误
/*13 余额不足类*/
0x00040000=余额不足类
/*14 配置参数类错误*/  
0x00700000=配置参数类错误
/*15 UD数据类错误*/  
0x00800000=UD数据类错误         
/*16 硬件类错误*/       
0x00900000=硬件类错误
/*17 状态机类错误*/  
0x00070000=状态机类错误
/*18 锁卡操作类*/
0x00010000=锁卡操作类
/*19 未归类错*/
0x00f00000=硬件类错误
/*20 钱包加值异常*/
0x00B10000=卡片加值操作未完成，请重新刷卡。
0x00B20000=卡片加值操作未完成，不是同一张卡，请重新刷卡。
/*21 参数类错误*/
0x00090000=参数类

/*1 寻卡类错误*/
[TPUERROR_INFO]

;===	DCR4000 ERROR CODE ===========


0x0000FF11 = 关闭通信错误
0x0000FF12 = 发送数据超时
0x0000FF13 = 接受数据超时
0x0000FF14 = 接受TPU数据失败
0x0000FF15 = 下载参数失败
0x0000FF16 = 下载序列号失败 
0x0000FF17 = 命令已发送等待
0x0000FF18 = 命令已取消
0x0000FF19 = 打开串口失败
0x0000FF20 = 当输入的设备类型不正确时.
0x0000FF21 = 当获不到空闲的数据包.
0x0000FF22 = 当获取不到数据时
0x0000FF23 = 当接口函数提供数据的输出缓存不足时
0x0000FF24 = 当没有数据要返回时
0x0000FF25 = 分配内存出错了
0x0000FF26 = 文件错误
0x0000FF31 = 须上传最后一交易
0x0000FF32 = 设备需要初验(只对CPU卡可用)
0x0000FF33 = 初验结束(只对M1卡有用)
0x0000FF34 = 卡片错误
0x0000FF35 = 指针错误
0x0000FF36 = 超时处理
0x0000FF37 = 接收的数据长度不够
0x0000FF38 = 连接服务器失败
0x0000FF39 = 函数参数错误
0x0000FF3A =
0x0000FF3B =
0x0000FF3C =
0x0000FF3D = 
0x0000FF3E = 
0x0000FF3F = 
0x0000FF40 = 联机相应报文件中的命令码错误
0x0000FF50 = 联机相应报文件中的命令码错误
0x0000E000 = 联机服务机返回了错误代码
0x0000E001 = MAC校验错误           
0x0000E010 = 密钥奇偶校验错误      
0x0000E012 = 指定GVI的密钥存储区无密钥
0x0000E013 = LMK错                 
0x0000E015 = 输入数据错/数据域长度错误
0x0000E017 = 密码机不在授权状态/初始化权限不足
0x0000E027 = 密钥属性（类型）密钥长
0x0000E041 = 系统错误/内部硬件故障 
0x0000E050 = 密码机不在双重授权状态
0x0000E051 = 算法选择域错          
0x0000E058 = 密钥索引无效－区超出范
0x0000E059 = 密钥索引无效－版本超出
0x0000E060 = 密钥索引无效－索引超出
0x0000E061 = 密钥属性错误          
0x0000E062 = 密钥不能分散          
0x0000E063 = 密钥必须分散          
0x0000E064 = 密钥超过最大分散次数  
0x0000E069 = 非法创建应用密钥      
0x0000E080 = 分散因子数据太短/报文长度错
0x0000E090 = 终端IP未经过加密机授权
0x0000FF52 = 联机服务机返回的MAC2长度错误(长度不等于4)
0x0000FF53 = 联机读卡返回的"卡片类型"有误.
0x0000FF54 = 联机读卡返回的"需修改文件的个数"有误.
0x0000FF61 = 向联机服务发送数据失败。
0x0000FF62 = 从联机服务上获取数据失败。
0x0000FF64 = 联机售卡(充值)时,从TPU中读取的密钥类型不正确


;===     TPU ERROR CODE ===========

0x00100000=寻卡类错误
0x00100001=无卡
0x00100002=卡片CRC校验错误
0x00100003=数值溢出错误
0x00100004=验证不成功
0x00100005=卡片奇偶校验错误
0x00100006=通讯错误(BCC校验错)
0x00100007=卡片序列号错误(anticol错误)
0x00100008=卡片数据长度字节错误(SELECT错误)
0x00100009=卡片没有通过验证
0x0010000a=从卡片接收到的位数错误
0x0010000b=从卡片接收到的字节数错误（仅仅读函数有效）
0x0010000c=调用restore函数出错
0x0010000d=调用transfer函数出错
0x0010000e=调用write函数出错
0x0010000f=调用increment函数出错
0x00100011=调用decrement函数出错
0x00100012=调用read函数出错
0x00100013=调用LOADKEY函数出错
0x00100014=RC531帧错误
0x00100015=调用req函数出错
0x00100016=调用sel函数出错
0x00100017=调用anticoll函数出错
0x00100018=调用初始化函数出错
0x00100019=调用高级读块值函数出错
0x0010001a=CPU卡复位命令出错
0x00100021=发送request指令没有响应
0x00100022=发送anticoll指令没有响应
0x00100023=发送select指令没有响应
0x00100024=发送rats指令没有响应
0x00100025=发送loadkey指令没有响应
0x00100026=发送authen1指令没有响应
0x00100027=发送authen2指令没有响应
0x00100028=发送read指令没有响应
0x00100029=发送write指令没有响应
0x0010002a=发送increment指令没有响应
0x0010002b=发送decrement指令没有响应
0x0010002c=发送restore指令没有响应
0x0010002d=发送transfer指令没有响应
0x0010002f=发送cpu卡APDU指令没有响应
0x00100030=发送cpu卡APDU指令错误
0x00100031=发送cpu卡APDU指令错误
0x00100032=发送cpu卡APDU指令错误
0x00100033=发送cpu卡APDU指令错误
0x00100034=发送cpu卡APDU指令错误
0x00100035=发送cpu卡APDU指令错误
0x00100036=发送cpu卡APDU指令错误
0x00100037=发送cpu卡APDU指令错误
0x00100038=发送cpu卡APDU指令错误
0x00100039=发送cpu卡APDU指令错误
0x0010003a=发送cpu卡APDU指令错误
0x0010003b=发送cpu卡APDU指令错误
0x0010003c=发送cpu卡APDU指令错误
0x0010003d=发送cpu卡APDU指令错误
0x0010003e=发送cpu卡APDU指令错误
0x0010003f=发送cpu卡APDU指令错误
0x00100040=cpu卡select目录指令错误
0x00100041=cpu卡select目录指令错误
0x00100055=无效卡类型
0x00100060=同一张卡
0x00100061=超过1张卡
0x00100062=卡号长度错误不是4或7
0x00100063=REQUEST返回值为14443协议的预留字节
0x00100064=UID不完整
0x00100070=寻卡时暂停响应其他命令
0x00100071=卡被移开
0x00100072=不是天津地铁系统规定的卡片
0x00100073=
0x00100074=
0x00100075=
0x00100076=
0x00100077=
0x00100078=
0x00100079=
0x0010007A=
0x0010007B=
0x0010007C=
0x0010007D=
0x0010007E=
0x0010007F=
0x00100080=
0x00100081=
0x00100082=
0x00100083=
0x00100084=
0x00100085=
0x00100086=
0x00100087=
0x00100088=
0x00100089=
0x0010008A=
0x0010008B=
0x0010008C=
0x0010008D=
0x0010008E=
0x0010008F=
0x00100090=
0x00100091=
0x00100092=
0x00100093=
0x00100094=
0x00100095=
0x00100096=
0x00100097=
0x00100098=
0x00100099=
0x0010009A=
0x0010009B=
0x0010009C=
0x0010009D=
0x0010009E=
0x0010009F=
0x001000A0=
0x001000A1=
0x001000A2=
0x001000A3=
0x001000A4=
0x001000A5=
0x001000A6=
0x001000A7=
0x001000A8=
0x001000A9=
0x001000AA=
0x001000AB=
0x001000AC=
0x001000AD=
0x001000AE=
0x001000AF=
0x00100A00=指令错误后读取RC531Err寄存器内容
0x00100A00=
0x00100A01=
0x00100A02=
0x00100A03=
0x00100A04=
0x00100A05=
0x00100A06=
0x00100A07=
0x00100A08=
0x00100A09=
0x00100A0A=
0x00100A0B=
0x00100A0C=
0x00100A0D=
0x00100A0E=
0x00100A0F=
0x00100A10=
0x00100A11=
0x00100A12=
0x00100A13=
0x00100A14=
0x00100A15=
0x00100A16=
0x00100A17=
0x00100A18=
0x00100A19=
0x00100A1A=
0x00100A1B=
0x00100A1C=
0x00100A1D=
0x00100A1E=
0x00100A1F=

/*2 超时未读到卡错误*/
0x00140000=超时未读到卡
0x00140000=超时未读到卡
0x00140010=
0x00140011=
0x00140012=
0x00140013=
0x00140014=
0x00140015=
0x00140016=
0x00140017=
0x00140018=
0x00140019=
0x0014001A=
0x0014001B=
0x0014001C=
0x0014001D=
0x0014001E=
0x0014001F=

/*2 票卡读卡类错误*/
0x00050000=票卡读卡类错误
0x00050001=卡片类型错误
/*2.1 M1卡读卡类错误*/
#define mERR_M1_READmERR_CARD_READ/*M1卡读卡类错误*/
0x00050010=M1卡扇区00读失败
0x00050011=M1卡扇区01读失败
0x00050012=M1卡扇区02读失败
0x00050013=M1卡扇区03读失败
0x00050014=M1卡扇区04读失败
0x00050015=M1卡扇区05读失败
0x00050016=M1卡扇区06读失败
0x00050017=M1卡扇区07读失败
0x00050018=M1卡扇区08读失败
0x00050019=M1卡扇区09读失败
0x0005001a=M1卡扇区10读失败
0x0005001b=M1卡扇区11读失败
0x0005001c=M1卡扇区12读失败
0x0005001d=M1卡扇区13读失败
0x0005001e=M1卡扇区14读失败
0x0005001f=M1卡扇区15读失败
0x00050020=M1卡读卡扇区读卡失败
0x00050021=M1卡钱包读操作失败
0x00050022=M1卡读交易计数读卡失败
0x00050023= 无效数据CRC计算
0x00050080= 断点读失败
0x00050081= 断点读第1 个扇区失败
0x00050082= 断点读第2 个扇区失败
0x00050083= 断点读第3 个扇区失败
0x00050084= 断点读第4 个扇区失败
0x00050085= 断点读第5 个扇区失败
0x00050086= 断点读第6 个扇区失败
0x00050087= 断点读第7 个扇区失败
0x00050088= 断点读第8 个扇区失败
0x00050089= 断点读第9 个扇区失败
0x0005008A= 断点读第10 个扇区失败
0x0005008B= 断点读第11 个扇区失败
0x0005008C= 断点读第12 个扇区失败
0x0005008D= 断点读第13 个扇区失败
0x0005008E= 断点读第14 个扇区失败
0x0005008F= 断点读第15 个扇区失败
/*2.2 CPU卡读卡类错误*/
#define mERR_CPU_READmERR_CARD_READ/*CPU卡读卡类错误*/
0x00050024=CPU卡读EF01错误
0x00050025=CPU卡读EF02错误
0x00050026=CPU卡读EF03错误
0x00050027=CPU卡读EF04错误
0x00050028=CPU卡读EF05错误
0x00050029=CPU卡读EF06错误
0x0005002a=CPU卡读EF11错误
0x0005002b=CPU卡读EF12错误
0x0005002c=CPU卡读EF13错误
0x0005002d=CPU卡读EF14错误
0x0005002e=CPU卡读EF15错误
0x0005002f=CPU卡读EF16错误
0x00050030=CPU卡读钱包错误
0x00050031=CPU卡读消费记录错误
0x00050032=CPU卡PIN认证错误
0x00050033=CPU卡读交易明细错误
0x00050034=CPU卡读充值记录错误
0x00050080=断点读失败
0x00050081=断点读第1个文件失败
0x00050082=断点读第2个文件失败
0x00050083=断点读第3个文件失败
0x00050084=断点读第4个文件失败
0x00050085=断点读第5个文件失败
0x00050086=断点读第6个文件失败
0x00050087=断点读第7个文件失败
0x00050088=断点读第8个文件失败
0x00050089=断点读第9个文件失败
0x0005008A=断点读第10个文件失败
0x0005008B=断点读第11个文件失败
0x0005008C=断点读第12个文件失败
0x0005008D=断点读第13个文件失败
0x0005008E=断点读第14个文件失败
0x0005008F=断点读第15个文件失败
0x00050090=读0x05(发行本信息文件)文件错误
/*2.3 UL卡读卡类错误*/
#define mERR_UL_READmERR_CARD_READ/*UL卡读卡类错误*/
0x00050035=UL卡读卡静态区MAC错误
0x00050036=UL卡读卡动态A区MAC错误
0x00050037=UL卡读卡动态B区MAC错误
0x00050038=UL卡读卡静态区错误
0x00050039=UL卡读卡动态A错误
0x0005003a=UL卡读卡动态B错误
0x0005003b=UL卡写完一页后回读失败,请重新放卡
0x0005003c=无效UL卡MAC
0x0005003d=无效UL卡MAC
0x0005003e=无效UL卡MAC
0x0005003f=无效UL卡MAC
0x00050040=无卡
0x00050041=UL读卡错误
0x00050042=token写卡时计算crc错误
0x00050043=token写卡时计算DH错误
0x00050044=token读卡时计算DH或CRC错误
0x00050100=CPU卡读交易认证码失败
0x00050101=验证CPU卡交易认证码失败
0x00050102=未成功读卡，不允许进行写UL卡操作
0x00050103=传入的目录代码不正确
0x00050104=传入的目录级数错误
0x00050105=传入的SFI错误
0x00050106=卡已被永久性锁定，无法操作
0x00050107=读钱包错误
0x00050108=读二进制文件错误
0x00050109=读记录文件错误
0x0005010A=UL卡计算MAC2时从PSAM卡获取密钥错误
0x0005010B=卡被应用锁定
0x0005010C=选择目录错误
0x0005010D=读二进制文件时APDU命令错误
0x0005010E=读记录文件时APDU命令错误
0x0005010F=读钱包文件时APDU命令错误
0x00050110=
0x00050111=
0x00050112=
0x00050113=
0x00050114=
0x00050115=
0x00050116=
0x00050117=
0x00050118=
0x00050119=
0x0005011A=
0x0005011B=
0x0005011C=
0x0005011D=
0x0005011E=
0x0005011F=
0x00050120=
0x00050121=
0x00050122=
0x00050123=
0x00050124=
0x00050125=
0x00050126=
0x00050127=
0x00050128=
0x00050129=
0x0005012A=
0x0005012B=
0x0005012C=
0x0005012D=
0x0005012E=
0x0005012F=
0x00050130=
0x00050131=
0x00050132=
0x00050133=
0x00050134=
0x00050135=
0x00050136=
0x00050137=
0x00050138=
0x00050139=
0x0005013A=
0x0005013B=
0x0005013C=
0x0005013D=
0x0005013E=
0x0005013F=

/*3 M1卡认证类错误*/
0x00200000=M1卡扇区认证
0x00200000=M1卡扇区00认证失败
0x00200001=M1卡扇区01认证失败
0x00200002=M1卡扇区02认证失败
0x00200003=M1卡扇区03认证失败
0x00200004=M1卡扇区04认证失败或无卡
0x00200005=M1卡扇区05认证失败
0x00200006=M1卡扇区06认证失败
0x00200007=M1卡扇区07认证失败
0x00200008=M1卡扇区08认证失败
0x00200009=M1卡扇区09认证失败
0x0020000a=M1卡扇区10认证失败
0x0020000b=M1卡扇区11认证失败
0x0020000c=M1卡扇区12认证失败
0x0020000d=M1卡扇区13认证失败
0x0020000e=M1卡扇区14认证失败
0x0020000f=M1卡扇区15认证失败
0x00200010=M1卡读卡扇区认证失败
0x00200011=M1卡写卡扇区认证失败
0x00200012=M1卡擦除卡扇区认证失败
0x00200013=M1卡认证失败
0x00200014=M1卡读钱包认证失败
0x00200015=M1卡写钱包认证失败
0x00200016=M1卡钱包增值认证失败
0x00200017=M1卡钱包减值认证失败
0x00200018=M1卡读交易计数认证失败
0x00200019=M1卡写交易计数认证失败
0x0020001a=M1卡交易计数增加认证失败
0x00200100=
0x00200101=
0x00200102=
0x00200103=
0x00200104=
0x00200105=
0x00200106=
0x00200107=
0x00200108=
0x00200109=
0x0020010A=
0x0020010B=
0x0020010C=
0x0020010D=
0x0020010E=
0x0020010F=
0x00200110=
0x00200111=
0x00200112=
0x00200113=
0x00200114=
0x00200115=
0x00200116=
0x00200117=
0x00200118=
0x00200119=
0x0020011A=
0x0020011B=
0x0020011C=
0x0020011D=
0x0020011E=
0x0020011F=
0x00200120=
0x00200121=
0x00200122=
0x00200123=
0x00200124=
0x00200125=
0x00200126=
0x00200127=
0x00200128=
0x00200129=
0x0020012A=
0x0020012B=
0x0020012C=
0x0020012D=
0x0020012E=
0x0020012F=
0x00200130=
0x00200131=
0x00200132=
0x00200133=
0x00200134=
0x00200135=
0x00200136=
0x00200137=
0x00200138=
0x00200139=
0x0020013A=
0x0020013B=
0x0020013C=
0x0020013D=
0x0020013E=
0x0020013F=

/*4 票卡写操作类错误*/
0x00060000=票卡写操作类错误
/*4.1 M1卡写卡卡类错误*/
#define mERR_M1_WRITEmERR_CARD_WRITE/*M1卡写卡卡类错误*/
0x00060010=M1卡扇区00写失败
0x00060011=M1卡扇区01写失败
0x00060012=M1卡扇区02写失败
0x00060013=M1卡扇区03写失败
0x00060014=M1卡扇区04写失败
0x00060015=M1卡扇区05写失败
0x00060016=M1卡扇区06写失败
0x00060017=M1卡扇区07写失败
0x00060018=M1卡扇区08写失败
0x00060019=M1卡扇区09写失败
0x0006001a=M1卡扇区10写失败
0x0006001b=M1卡扇区11写失败
0x0006001c=M1卡扇区12写失败
0x0006001d=M1卡扇区13写失败
0x0006001e=M1卡扇区14写失败
0x0006001f=M1卡扇区15写失败
0x00060020=M1卡写块失败
0x00060021=M1卡擦除卡扇区写卡失败
0x00060022=M1卡写卡失败
0x00060023=M1卡写钱包写卡失败
0x00060024=M1卡写交易计数写卡失败
0x00060025=M1卡交易计数增加写卡失败
0x00060026=M1卡钱包操作写卡失败
0x00060027=M1卡恢复交易计数正本写卡失败
0x00060028=M1卡恢复交易计数备份写卡失败
0x00060029=M1卡减值操作失败
0x0006002a=M1卡写交易计数读卡失败
0x0006002b=M1卡交易计数增加读卡失败
0x0006002c=M1卡增值操作失败
0x00060080= 断点写失败
0x00060081= 断点写第01 个扇区失败
0x00060082= 断点写第02 个扇区失败
0x00060083= 断点写第03 个扇区失败
0x00060084= 断点写第04 个扇区失败
0x00060085= 断点写第05 个扇区失败
0x00060086= 断点写第06 个扇区失败
0x00060087= 断点写第07 个扇区失败
0x00060088= 断点写第08 个扇区失败
0x00060089= 断点写第09 个扇区失败
0x0006008A= 断点写第10 个扇区失败
0x0006008B= 断点写第11 个扇区失败
0x0006008C= 断点写第12 个扇区失败
0x0006008D= 断点写第13 个扇区失败
0x0006008E= 断点写第14 个扇区失败
0x0006008F= 断点写第15 个扇区失败
/*4.2 CPU卡写卡类错误*/
#define mERR_CPU_WRITE			mERR_CARD_WRITE		/*CPU卡写卡类错误*/
0x00060030=CPU卡写EF02错误
0x00060031=CPU卡写EF05错误
0x00060032=CPU卡写EF15错误
0x00060033=CPU卡写EF16错误
0x00060034=CPU卡写EF17错误
0x00060035=CPU卡写EF18错误
0x00060036=CPU卡写EF19错误
0x00060037=CPU卡写EF1A错误
0x00060038=CPU卡写EF1B错误
0x00060039=CPU卡写EF1C错误
0x0006003a=CPU卡写EF1D错误
0x0006003b=CPU卡写EF1E错误
0x0006003c=CPU卡写钱包错误
0x0006003d=CPU卡写消费记录错误
0x0006003e=CPU卡复合消费计算MAC错误
0x0006003f=CPU卡获取认证码错误
0x00060040=CPU卡PSAM认证错误
0x00060041=CPU卡写复合消费初始化错误
0x00060042=CPU卡写EF05计算MAC错误
0x00060043=CPU卡写EF06计算MAC错误
0x00060044=CPU卡写EF11计算MAC错误
0x00060045=CPU卡写EF12计算MAC错误
0x00060046=CPU卡写EF13计算MAC错误
0x00060047=CPU卡写EF14计算MAC错误
0x00060048=CPU卡写EF15计算MAC错误
0x00060049=CPU卡写EF16计算MAC错误
0x0006004A=CPU卡写卡时输入的SAM卡类型错误
0x0006004B=CPU卡写卡时验证PIN错误
0x0006004C=CPU卡写卡时圈存初始化错误
0x0006004D=CPU卡写卡时圈存错误
0x0006004E=CPU卡写卡时获取随机数错误
0x0006004F=CPU卡写卡时DES初始化错误
0x00060050=CPU卡写卡时DES计算MAC错误
0x00060051=CPU卡写卡时写文件错误
0x00060080= 断点写失败
0x00060081= 断点写第1个文件失败
0x00060082= 断点写第2个文件失败
0x00060083= 断点写第3个文件失败
0x00060084= 断点写第4个文件失败
0x00060085= 断点写第5个文件失败
0x00060086= 断点写第6个文件失败
0x00060087= 断点写第7个文件失败
0x00060088= 断点写第8个文件失败
0x00060089= 断点写第9个文件失败
0x0006008A= 断点写第10个文件失败
0x0006008B= 断点写第11个文件失败
0x0006008C= 断点写第12个文件失败
0x0006008D= 断点写第13个文件失败
0x0006008E= 断点写第14个文件失败
0x0006008F= 断点写第15个文件失败
/*4.3 UL卡写卡类错误*/
#define mERR_UL_WRITEmERR_CARD_WRITE/*UL卡写卡类错误*/
0x00060050=UL卡写卡静态区错误
0x00060051=UL卡写卡动态A错误
0x00060052=UL卡写卡动态B错误
0x00060053=UL卡写页错误
/*4.4 卡钱包操作类错误*/ 
#define mERR_PURSE_OPERmERR_CARD_WRITE/*卡钱包操作类错误*/
0x00060060=主卡钱包TRANSFER操作错误
0x00060061=主卡钱包RESTORE操作错误
0x00060062=主卡钱包WRITE操作错误
0x00060063=主卡钱包DECREASE操作错误
0x00060064=主卡钱包INCREASE操作错误
0x00060065=备份钱包TRANSFER操作错误
0x00060066=备份钱包RESTORE操作错误
0x00060067=备份卡钱包WRITE操作错误
0x00060068=M1卡钱包写操作读卡失败
0x00060069=M1卡钱包增值操作读卡失败
0x0006006a=M1卡钱包减值操作读卡失败
0x00060100=UL卡断点回复写失败
0x00060101=钱包扣款动作正常，但是钱没有扣掉
0x00060102=UL卡消费断点恢复写B块失败
0x00060103=UL卡消费断点恢复写A块失败
0x00060104=UL卡消费读无断点
0x00060105=UL卡消费读卡后有断点但断点恢复失败
0x00060106=UL卡有断点记录，但记录内没有信息
0x00060107=计算UD的TAC错误
0x00060108=CPU卡写卡时DES计算MAC错误              
0x00060109=CPU卡写卡时写文件错误                  
0x0006010A=获取认证信息时APDU命令错误             
0x0006010B=符合消费初始化时APDU命令错误           
0x0006010C=符合消费时更新记录文件APDU命令错误     
0x0006010D=更新二进制文件时APDU命令错误           
0x0006010E=更新记录文件时APDU命令错误             
0x0006010F=认证PIN码时APDU命令错误                
0x00060110=圈存初始化时APDU命令错误               
0x00060111=圈存写钱包时APDU命令错误               
0x00060112=应用锁卡时APDU命令错误                 
0x00060113=应用解锁时APDU命令错误                 
0x00060114=PSAM卡验证认证信息时APDU命令错误       
0x00060115=PSAM卡计算MAC1时APDU命令错误           
0x00060116=PSAM卡验证MAC2时APDU命令错误           
0x00060117=PSAM卡DES初始化时APDU命令错误          
0x00060118=PSAM卡DES初始化时APDU命令错误          
0x00060119=PSAM卡锁卡计算MAC时APDU命令错误        
0x0006011A=PSAM卡解锁计算MAC时APDU命令错误        
0x0006011B=PSAM卡二进制文件计算MAC时APDU命令错误  
0x0006011C=PSAM卡记录文件计算MAC时APDU命令错误 
0x0006011D=
0x0006011E=
0x0006011F=
0x00060120=
0x00060121=
0x00060122=
0x00060123=
0x00060124=
0x00060125=
0x00060126=
0x00060127=
0x00060128=
0x00060129=
0x0006012A=
0x0006012B=
0x0006012C=
0x0006012D=
0x0006012E=
0x0006012F=
0x00060130=
0x00060131=
0x00060132=
0x00060133=
0x00060134=
0x00060135=
0x00060136=
0x00060137=
0x00060138=
0x00060139=
0x0006013A=
0x0006013B=
0x0006013C=
0x0006013D=
0x0006013E=
0x0006013F=

/*5 SAM卡处理公共类错误*/
0x00300000=SAM卡处理公共类错误
0x00300001=SAM卡计算MAC错误
0x00300002=SAM卡复位错误
0x00300003=SAM卡获取密钥错误
0x00300004=SAM卡选择目录错误
0x00300005=SAM卡计算UD MAC错误
0x00300006=SAM卡APDU指令错误
0x00300100=
0x00300101=
0x00300102=
0x00300103=
0x00300104=
0x00300105=
0x00300106=
0x00300107=
0x00300108=
0x00300109=
0x0030010A=
0x0030010B=
0x0030010C=
0x0030010D=
0x0030010E=
0x0030010F=
0x00300110=
0x00300111=
0x00300112=
0x00300113=
0x00300114=
0x00300115=
0x00300116=
0x00300117=
0x00300118=
0x00300119=
0x0030011A=
0x0030011B=
0x0030011C=
0x0030011D=
0x0030011E=
0x0030011F=
0x00300120=
0x00300121=
0x00300122=
0x00300123=
0x00300124=
0x00300125=
0x00300126=
0x00300127=
0x00300128=
0x00300129=
0x0030012A=
0x0030012B=
0x0030012C=
0x0030012D=
0x0030012E=
0x0030012F=
0x00300130=
0x00300131=
0x00300132=
0x00300133=
0x00300134=
0x00300135=
0x00300136=
0x00300137=
0x00300138=
0x00300139=
0x0030013A=
0x0030013B=
0x0030013C=
0x0030013D=
0x0030013E=
0x0030013F=

/*6 一卡通PSAM操作类错误*/  
0x00310000=一卡通PSAM操作类错误
0x00310001=一卡通PSAM操作类错误
0x00310002=一卡通获取PSAM消费密钥错误
0x00310100=
0x00310101=
0x00310102=
0x00310103=
0x00310104=
0x00310105=
0x00310106=
0x00310107=
0x00310108=
0x00310109=
0x0031010A=
0x0031010B=
0x0031010C=
0x0031010D=
0x0031010E=
0x0031010F=
0x00310110=
0x00310111=
0x00310112=
0x00310113=
0x00310114=
0x00310115=
0x00310116=
0x00310117=
0x00310118=
0x00310119=
0x0031011A=
0x0031011B=
0x0031011C=
0x0031011D=
0x0031011E=
0x0031011F=
0x00310120=
0x00310121=
0x00310122=
0x00310123=
0x00310124=
0x00310125=
0x00310126=
0x00310127=
0x00310128=
0x00310129=
0x0031012A=
0x0031012B=
0x0031012C=
0x0031012D=
0x0031012E=
0x0031012F=
0x00310130=
0x00310131=
0x00310132=
0x00310133=
0x00310134=
0x00310135=
0x00310136=
0x00310137=
0x00310138=
0x00310139=
0x0031013A=
0x0031013B=
0x0031013C=
0x0031013D=
0x0031013E=
0x0031013F=

/*7 一卡通ISAM操作类错误*/  
0x00320000=一卡通ISAM操作类错误
0x00320001=一卡通ISAM计算第1扇区KEYB错误
0x00320002=一卡通ISAM计算第2扇区KEYB错误
0x00320003=一卡通ISAM计算第3扇区KEYB错误
0x00320004=一卡通ISAM计算第4扇区KEYB错误
0x00320005=一卡通ISAM计算第5扇区KEYB错误
0x00320006=一卡通ISAM计算第6扇区KEYB错误
0x00320007=一卡通ISAM计算第7扇区KEYB错误
0x00320008=一卡通ISAM计算第8扇区KEYB错误
0x00320009=一卡通ISAM计算第9扇区KEYB错误
0x0032000a=一卡通ISAM计算第10扇区KEYB错误
0x0032000b=一卡通ISAM计算第11扇区KEYB错误
0x0032000c=一卡通ISAM计算第12扇区KEYB错误
0x0032000d=一卡通ISAM计算第13扇区KEYB错误
0x0032000e=一卡通ISAM计算第14扇区KEYB错误
0x0032000f=一卡通ISAM计算第15扇区KEYB错误
0x00320010=一卡通ISAM计算TAC错误
0x00320011=一卡通ISAM初始化DES运算失败
0x00320012=一卡通ISAM DES运算失败
0x00320100=
0x00320101=
0x00320102=
0x00320103=
0x00320104=
0x00320105=
0x00320106=
0x00320107=
0x00320108=
0x00320109=
0x0032010A=
0x0032010B=
0x0032010C=
0x0032010D=
0x0032010E=
0x0032010F=
0x00320110=
0x00320111=
0x00320112=
0x00320113=
0x00320114=
0x00320115=
0x00320116=
0x00320117=
0x00320118=
0x00320119=
0x0032011A=
0x0032011B=
0x0032011C=
0x0032011D=
0x0032011E=
0x0032011F=
0x00320120=
0x00320121=
0x00320122=
0x00320123=
0x00320124=
0x00320125=
0x00320126=
0x00320127=
0x00320128=
0x00320129=
0x0032012A=
0x0032012B=
0x0032012C=
0x0032012D=
0x0032012E=
0x0032012F=
0x00320130=
0x00320131=
0x00320132=
0x00320133=
0x00320134=
0x00320135=
0x00320136=
0x00320137=
0x00320138=
0x00320139=
0x0032013A=
0x0032013B=
0x0032013C=
0x0032013D=
0x0032013E=
0x0032013F=

/*8 一票通PSAM操作类错误*/  
0x00330000=一票通PSAM操作类错误
0x00330100=
0x00330101=
0x00330102=
0x00330103=
0x00330104=
0x00330105=
0x00330106=
0x00330107=
0x00330108=
0x00330109=
0x0033010A=
0x0033010B=
0x0033010C=
0x0033010D=
0x0033010E=
0x0033010F=
0x00330110=
0x00330111=
0x00330112=
0x00330113=
0x00330114=
0x00330115=
0x00330116=
0x00330117=
0x00330118=
0x00330119=
0x0033011A=
0x0033011B=
0x0033011C=
0x0033011D=
0x0033011E=
0x0033011F=
0x00330120=
0x00330121=
0x00330122=
0x00330123=
0x00330124=
0x00330125=
0x00330126=
0x00330127=
0x00330128=
0x00330129=
0x0033012A=
0x0033012B=
0x0033012C=
0x0033012D=
0x0033012E=
0x0033012F=
0x00330130=
0x00330131=
0x00330132=
0x00330133=
0x00330134=
0x00330135=
0x00330136=
0x00330137=
0x00330138=
0x00330139=
0x0033013A=
0x0033013B=
0x0033013C=
0x0033013D=
0x0033013E=
0x0033013F=

/*9 一票通ISAM操作类错误*/  
0x00340000=一票通ISAM操作类错误
0x00340100=
0x00340101=
0x00340102=
0x00340103=
0x00340104=
0x00340105=
0x00340106=
0x00340107=
0x00340108=
0x00340109=
0x0034010A=
0x0034010B=
0x0034010C=
0x0034010D=
0x0034010E=
0x0034010F=
0x00340110=
0x00340111=
0x00340112=
0x00340113=
0x00340114=
0x00340115=
0x00340116=
0x00340117=
0x00340118=
0x00340119=
0x0034011A=
0x0034011B=
0x0034011C=
0x0034011D=
0x0034011E=
0x0034011F=
0x00340120=
0x00340121=
0x00340122=
0x00340123=
0x00340124=
0x00340125=
0x00340126=
0x00340127=
0x00340128=
0x00340129=
0x0034012A=
0x0034012B=
0x0034012C=
0x0034012D=
0x0034012E=
0x0034012F=
0x00340130=
0x00340131=
0x00340132=
0x00340133=
0x00340134=
0x00340135=
0x00340136=
0x00340137=
0x00340138=
0x00340139=
0x0034013A=
0x0034013B=
0x0034013C=
0x0034013D=
0x0034013E=
0x0034013F=

/*10 通讯接口类错误*/
0x00400000=通讯接口类错误
0x00400001=数据校验错误
0x00400002=无效命令
0x00400003=接收数据缓冲区溢出
0x00400004=接收到无效的字符
0x00400005=命令数据长度错误
0x00400006=无法使用的卡片类型
0x00400100=
0x00400101=
0x00400102=
0x00400103=
0x00400104=
0x00400105=
0x00400106=
0x00400107=
0x00400108=
0x00400109=
0x0040010A=
0x0040010B=
0x0040010C=
0x0040010D=
0x0040010E=
0x0040010F=
0x00400110=
0x00400111=
0x00400112=
0x00400113=
0x00400114=
0x00400115=
0x00400116=
0x00400117=
0x00400118=
0x00400119=
0x0040011A=
0x0040011B=
0x0040011C=
0x0040011D=
0x0040011E=
0x0040011F=
0x00400120=
0x00400121=
0x00400122=
0x00400123=
0x00400124=
0x00400125=
0x00400126=
0x00400127=
0x00400128=
0x00400129=
0x0040012A=
0x0040012B=
0x0040012C=
0x0040012D=
0x0040012E=
0x0040012F=
0x00400130=
0x00400131=
0x00400132=
0x00400133=
0x00400134=
0x00400135=
0x00400136=
0x00400137=
0x00400138=
0x00400139=
0x0040013A=
0x0040013B=
0x0040013C=
0x0040013D=
0x0040013E=
0x0040013F=

/*11 一票通业务处理类错误*/  
0x00500000=一票通业务处理类错误
0x00500001=卡片物理类型不对
0x00500002=非法卡标记为停用token卡
0x00500003=参数规定此种车票未启用
0x00500004=此卡在黑名单中建议锁卡
0x00500005=车票子类型错误
0x00500006=车票模式与设备模式不匹配
0x00500007=
0x00500008=
0x00500009=
0x0050000A=
0x0050000B=
0x0050000C=
0x0050000D=
0x0050000E=
0x0050000F=
0x00500010=
0x00500011=
0x00500012=
0x00500013=
0x00500014=
0x00500015=
0x00500016=进站无效
0x00500017=
0x00500018=
0x00500019=
0x0050001A=
0x0050001B=
0x0050001C=
0x0050001D=
0x0050001F=
0x00500020=
0x00500021=
0x00500022=
0x00500023=
0x00500024=
0x00500025=
0x00500026=
0x00500027=
0x00500028=
0x00500029=
0x0050002A=
0x0050002B=
0x0050002C=
0x0050002D=
0x0050002E=
0x0050002F=
0x00500030=
0x00500031=
0x00500032=
0x00500033=
0x00500034=
0x00500035=
0x00500036=
0x00500037=
0x00500038=
0x00500039=
0x0050003A=
0x0050003B=
0x0050003C=
0x0050003D=
0x0050003E=
0x0050003F=
0x00500040=
0x00500041=
0x00500042=
0x00500043=
0x00500044=
0x00500045=
0x00500046=
0x00500047=
0x00500048=
0x00500049=
0x0050004A=
0x0050004B=
0x0050004C=
0x0050004D= 
0x0050004E=
0x0050004F=
0x00500050=
0x00500051=
0x00500052=
0x00500053=
0x00500054=
0x00500055=
0x00500056=
0x00500057=
0x00500058=
0x00500100=不是本地卡不允许使用 
0x00500101=参数中不允许充值 
0x00500102=充值金额超过参数限制 
0x00500103=充值后总金额超过参数限制 
0x00500104=钱包值非法 
0x00500105=透支金额非法 
0x00500106=票卡未发行，不能使用 
0x00500107=未到启用时间 
0x00500108=  
0x00500109=
0x0050010A=
0x0050010B=
0x0050010C=
0x0050010D=
0x0050010E=
0x0050010F=
0x00500110=
0x00500111=余额不足，请先充值
0x00500112=失效日期错误 
0x00500113=卡状态非法 
0x00500114=票卡已失效 
0x00500115=不允许透支 
0x00500116=透支达到上限 
0x00500117=当前时间此票种不允许进站 
0x00500118=当前车票是无效卡(测试标识==无效卡)
0x00500119=地铁应用卡片暂时不能使用 
0x0050011A=此卡不允许消费 
0x0050011B=此卡未加入白名单 
0x0050011C=售票金额小于押金 
0x0050011D=卡状态为未售时，不允许操作 
0x0050011E=工作票只允许指定站使用 
0x0050011F=此卡在有效期时间内，不需要延期 
0x00500120=token卡处理累计器已达最大值不能在操作
0x00500121=token卡当日更新计数器已达最大值
0x00500122=日乘坐次数达到上限
0x00500123=此卡不允许修改个人信息
0x00500124=此卡已被回收，不能使用
0x00500125=此卡被黑名单锁定，不能使用
0x00500126=此卡互联互通未启用
0x00500127=票卡种类不匹配
0x00500128=接收到的数据异常(DLL)
0x00500129=充值后总金额低于参数限制
0x0050012A=此卡已出售
0x0050012B=此卡已被黑名单锁定，禁止操作
0x0050012C=此卡在本系统的权限未开放
0x0050012D=充值金额低于参数限制
0x0050012E=卡状态非系统定义
0x0050012F=此卡已进站不允许退票
0x00500130=票卡正常不需补票。当前是紧急模式
0x00500131=票卡正常不需补票。当前列车故障模式
0x00500132=车站代码不是0(需输入车站代码)且车站代码不存在
0x00500133=补票读卡失败
0x00500134=票卡物理类型错误
0x00500135=车票类型错误
0x00500136=启用标志错误
0x00500137=不在有效期内
0x00500138=获取车票参数中没有此车票对应的参数
0x00500139=BR变量复制到写卡缓冲区时出错
0x0050013A=本站购买的单程票在未进站状态时，付费区不允许补进站码
0x0050013B=票卡已进站，不允许退卡
0x0050013C=此卡不允许修改个人信息
0x0050013D=参数限制，不允许退卡 
0x0050013E=命令解析异常 
0x0050013F=写卡时，软件异常 	
0x00500140=此卡余额超过上限 
0x00500141=写卡时，内部编码异常 
0x00500142=UL读卡异常 
0x00500143=此票卡不能出售 
0x00500144=此卡不允许充值 
0x00500145=本月使用次数已用尽 
0x00500146=补票建议代码不存在 
0x00500147=此卡余额低于下限
0x00500148=
0x00500149=
0x0050014A=UL卡替换时新卡和旧卡的卡类型不一致
0x0050014B=参数错误，未定义的回收模式定义
0x0050014C=UL卡售卡时发行区的卡类型错误，请使用发售种类对应的卡进行发售
0x0050014D=UL卡有没有完成的替换新卡操作
0x0050014E=UL卡请先进行旧卡替换，再进行新卡替换
0x0050014F=已进站UL卡不可以进行替换
0x00500150=只能在非付费区进行替换业务
0x00500151=当前UL卡票种不可以替换，仅纪念票可以替换
0x00500152=请发行免费出站票
0x00500153=补票读卡时设备输入了未定义的补票前读卡标记
0x00500154=出站站点与进站站点不一致
0x00500155=进站日期非当日
0x00500156=UL卡余额不足
0x00500157=UL卡售卡时，SLE填写的卡类型超出范围 
0x00500158=当前票种不允许进站
0x00500159=票卡子类型在系统编码中未定义
0x0050015A=票卡属性参数的扣款方式字段出现了未定义的值
0x0050015B=请发行新票不需要对原票处理
0x0050015C=该车票不能进行当前业务
0x0050015D=UL卡执行业务处理时卡片数据与读卡时不同
0x0050015E=UL卡执行业务处理时的卡与执行读卡信息时的卡不是同一张
0x0050015F=UL卡售卡时设备输入的车票产品种类与卡片不匹配
0x00500160=UL卡非付费区补票时补票建议代码不存在
0x00500161=付费区补票建议代码不存在
0x00500162=UL卡补票处理需要设备切换到非付费区，当补票建议代码为先补出站再补进站
0x00500163=出站无效
0x00500164=当UL卡的卡状态非已发售时不可以进出站
0x00500165=当前设备不可用
0x00500166=一票通UL或CPU卡数据信息改变(业务处理时与读卡信息时)
0x00500167=一票通UL或CPU卡被替换为不同物理卡号的卡(业务处理时与读卡信息时)
0x00500168=一票通卡被替换为不同物理类型的卡(业务处理时与读卡信息时)
0x00500169=出站票只能在售票站点出站
0x0050016A=当前票种不允许进站，如出站票
0x0050016B=获取最大滞留时间错误
0x0050016C=一票通UL卡在黑名单列表中，本次交易被锁定，请取交易数据
0x0050016D=出站超时
0x0050016E=补票站点与当前站点不一致
0x0050016F=出站时的补票类型错误
0x00500170=超时
0x00500171=超乘
0x00500172=费率参数查询失败
0x00500173=日历参数查询失败
0x00500174=非本站发售单程票
0x00500175=车票参数查询失败
0x00500176=当前ACC UL卡状态不允许出站
0x00500177=当前ACC UL卡状态不允许进站
0x00500178=ACC UL卡状态无法判别
0x00500179=不存在的UL卡车票类型
0x0050017A=一票通UL卡查不到对应的车票参数
0x0050017B=一票通UL卡不满足测试票限制
0x0050017C=一票通UL卡销售金额小于等于0
0x0050017D=错误的代币分类或者车票子类型
0x0050017E=一票通UL卡已经被锁定
0x0050017F=一票通UL卡在黑名单列表中 
0x00500180=票卡正常不需补票
0x00500181=此票不能补票，需发售新票
0x00500182=此卡不是UL卡
0x00500183=卡片状态错误
0x00500184=没有进站的卡在非特殊模式下不能退票
0x00500185=关闭模式 无法操作
0x00500186=输入参数有误
0x00500187=UL卡激活状态错误
0x00500188=车票参数不允许退票
0x00500189=卡类型错误
0x0050018A=卡状态错误
0x0050018B= 此卡不允许延期操作 

/*12 一卡通业务处理类错误*/													 
0x00600000=一卡通业务处理类错误
0x00600001=  
0x00600002=
0x00600003=
0x00600004=
0x00600005=
0x00600006=
0x00600007=
0x00600008=
0x00600009=
0x0060000a=
0x0060000b=
0x0060000c=
0x0060000d=
0x0060000e=
0x0060000f=
0x00600010=
0x00600011=
0x00600012=
0x00600013=
0x00600014=
0x00600015=
0x00600016=
0x00600017=
0x00600018=
0x00600019=
0x0060001a=
0x0060001b=
0x0060001c=
0x0060001d=
0x0060001e=
0x0060001f=
0x00600020=
0x00600021=
0x00600022=
0x00600023=
0x00600024=
0x00600025=
0x00600026=
0x00600027=
0x00600028=
0x00600029=
0x0060002a=
0x0060002b=
0x0060002c=
0x0060002d=
0x0060002e=
0x0060002f=
0x00600030=
0x00600031=
0x00600032=
0x00600033=
0x00600034=
0x00600035=
0x00600036=
0x00600037=
0x00600038=
0x00600039=
0x0060003a=
0x0060003b=
0x0060003c=
0x0060003d=
0x0060003e=
0x0060003f=
0x00600040=
0x00600041=
0x00600042=
0x00600043=
0x00600044=
0x00600045=
0x00600046=
0x00600047=
0x00600048=
0x00600049=
0x0060004a=
0x0060004b=
0x0060004c=
0x0060004d=
0x0060004e=
0x0060004f=
0x00600050=
0x00600051=
0x00600052=
0x00600053=
0x00600054=
0x00600055=
0x00600056=
0x00600057=
0x00600058=
0x00600059=
0x0060005a=
0x0060005b=
0x0060005c=
0x0060005d=
0x0060005e=
0x0060005f=
0x00600060=
0x00600061=
0x00600062=
0x00600064=
0x00600065=
0x00600066=
0x00600067=
0x00600068=
0x00600069=
0x0060006a=
0x0060006b=
0x0060006c=
0x0060006d=
0x0060006e=
0x0060006f=
0x00600070=
0x00600071=
0x00600072=
0x00600073=
0x00600074=
0x00600075=
0x00600076=
0x00600077=
0x00600078=
0x00600079=
0x0060007a=
0x0060007b=
0x0060007c=
0x0060007d=
0x0060007e=
0x0060007f=
0x00600080=
0x00600083=
0x00600084=
0x00600085=
0x00600086=	  
0x00600087=
0x00600088=
0x00600089=
0x0060008a=
0x0060008b=
0x0060008c=
0x0060008d=
0x0060008e=
0x0060008f=
0x00600090=
0x00600091=
0x00600092=
0x00600093=
0x00600094=
0x00600095=
0x00600096=
0x00600097=
0x00600098=
0x00600099=
0x0060009a=
0x0060009b=
0x0060009c=
0x0060009d=
0x0060009e=
0x0060009f=
0x006000a0=
0x006000a1=
0x006000a2=
0x006000a3=
0x006000a5=
0x006000a6=
0x006000a7=
0x006000a8=
0x006000a9=
0x006000aa=
0x006000ab=
0x006000ac=
0x006000ad=
0x006000ae=
0x006000af=
0x006000b0=卡片的物理类型无效
0x006000b1=
0x006000b2=
0x006000b3=
0x006000b4=
0x006000b5=   
0x006000b6=   
0x006000b7=   
0x006000b8=   
0x006000b9 =
0x006000ba=
0x006000bb=
0x006000bC=
0x006000bD=
0x006000bE=
0x006000bF=
0x006000c0=
0x006000c1=
0x006000C2=
0x006000C3=
0x006000C4=
0x006000C5=
0x006000C6=
0x006000C7=
0x00600100=一卡通卡物理类型错误
0x00600101=一卡通获取车票产品信息失败
0x00600102=一卡通卡片已锁定
0x00600103=一卡通卡在黑名单中，拒绝执行业务
0x00600104=一卡通卡在黑名单中，拒绝业务，并锁卡上传UD
0x00600105=一卡通卡，获取卡状态失败
0x00600106=一卡通卡，卡状态为未启用
0x00600107=卡已过有效期
0x00600108=查卡金额失败
0x00600109=卡金额错误
0x0060010A=一卡通补票建议代码错误
0x0060010B=
0x0060010C=
0x0060010D=
0x0060010E=
0x0060010F=
0x00600110=
0x00600111=
0x00600112=
0x00600113=
0x00600114=
0x00600115=
0x00600116=
0x00600117=
0x00600118=
0x00600119=
0x0060011A=
0x0060011B=
0x0060011C=
0x0060011D=
0x0060011E=
0x0060011F=
0x00600120=
0x00600121=
0x00600122=
0x00600123=
0x00600124=
0x00600125=
0x00600126=
0x00600127=
0x00600128=
0x00600129=
0x0060012A=
0x0060012B=
0x0060012C=
0x0060012D=
0x0060012E=
0x0060012F=
0x00600130=
0x00600131=
0x00600132=
0x00600133=
0x00600134=
0x00600135=
0x00600136=
0x00600137=
0x00600138=
0x00600139=
0x0060013A=
0x0060013B=
0x0060013C=
0x0060013D=
0x0060013E=
0x0060013F=
0x00600140=
0x00600141=
0x00600142=
0x00600143=
0x00600144=
0x00600145=
0x00600146=
0x00600147=
0x00600148=
0x00600149=
0x0060014A=
0x0060014B=
0x0060014C=
0x0060014D=
0x0060014E=
0x0060014F=
0x00600150=
0x00600151=
0x00600152=
0x00600153=
0x00600154=
0x00600155=
0x00600156=
0x00600157=
0x00600158=
0x00600159=
0x0060015A=
0x0060015B=
0x0060015C=
0x0060015D=
0x0060015E=
0x0060015F=
0x00600160=
0x00600161=
0x00600162=
0x00600163=
0x00600164=
0x00600165=
0x00600166=
0x00600167=
0x00600168=
0x00600169=
0x0060016A=
0x0060016B=
0x0060016C=
0x0060016D=
0x0060016E=
0x0060016F=
0x00600170=
0x00600171=
0x00600172=
0x00600173=一卡通M1卡数据信息改变(业务处理与读卡信息时)
0x00600174=一卡通M1卡被替换为不同物理卡号的卡(业务处理与读卡信息时)
0x00600175=一卡通卡片被替换为不同物理类型的卡片(业务处理时与读卡信息时)
0x00600176=一卡通M1卡车票产品类型无效
0x00600177=一卡通M1卡超时
0x00600178=关闭服务模式和紧急放行模式下不允许进行出站业务处理
0x00600179=M1卡钱包余额小于200
0x0060017A=M1卡在黑名单列表中，不允许进行业务处理
0x0060017B=M1卡已经被锁定
0x0060017C=关闭服务模式、紧急放行模式和进站免检模式下不允许进行进站业务处理
0x0060017D=M1卡当前旅程状态不允许出站
0x0060017E=M1卡当前旅程状态不允许进站
0x0060017F=未启用M1卡不允许进出站

/*13 余额不足类*/	
0x00040000=余额不足类
0x00040100=CPU卡钱包不足 
0x00040101=
0x00040102=
0x00040103=
0x00040104=
0x00040105=
0x00040106=
0x00040107=
0x00040108=
0x00040109=
0x0004010A=
0x0004010B=
0x0004010C=
0x0004010D=
0x0004010E=
0x0004010F=

/*14 配置参数类错误*/  
0x00700000=配置参数类错误
0x00700001=参数加载失败
0x00700002=参数保存失败
0x00700003=参数不完整
0x00700005=参数类型错误
0x00700006=参数保存空间不足
0x00700007=
0x00700008=
0x00700009=
0x0070000a=
0x0070000b=
0x0070000c=
0x0070000d=
0x0070000e=
0x0070000f=
0x00700011=
0x00700012=
0x00700013=
0x00700014=
0x00700015=
0x00700016=
0x00700021=gunzip function get inbuffer err
0x00700022=gunzip function get outbuffer err
0x00700023=gunzip err
0x00700024=gunzip err
0x00700100=参数不是gzip格式
0x00700101=
0x00700102=
0x00700103=
0x00700104=
0x00700105=
0x00700106=
0x00700107=
0x00700108=
0x00700109=
0x0070010A=
0x0070010B=
0x0070010C=
0x0070010D=
0x0070010E=
0x0070010F=
0x00700110=
0x00700111=
0x00700112=
0x00700113=
0x00700114=
0x00700115=
0x00700116=
0x00700117=
0x00700118=
0x00700119=
0x0070011A=
0x0070011B=
0x0070011C=
0x0070011D=
0x0070011E=
0x0070011F=
0x00700120=
0x00700121=
0x00700122=
0x00700123=
0x00700124=
0x00700125=
0x00700126=
0x00700127=
0x00700128=
0x00700129=
0x0070012A=
0x0070012B=
0x0070012C=
0x0070012D=
0x0070012E=
0x0070012F=
0x00700130=
0x00700131=
0x00700132=
0x00700133=
0x00700134=
0x00700135=
0x00700136=
0x00700137=
0x00700138=
0x00700139=
0x0070013A=
0x0070013B=
0x0070013C=
0x0070013D=
0x0070013E=
0x0070013F=
0x00700140=
0x00700141=
0x00700142=
0x00700143=
0x00700144=
0x00700145=
0x00700146=
0x00700147=
0x00700148=
0x00700149=
0x0070014A=
0x0070014B=
0x0070014C=
0x0070014D=
0x0070014E=
0x0070014F=
0x00700150=
0x00700151=
0x00700152=
0x00700153=
0x00700154=
0x00700155=
0x00700156=
0x00700157=
0x00700158=
0x00700159=
0x0070015A=
0x0070015B=
0x0070015C=
0x0070015D=
0x0070015E=
0x0070015F=
0x00700160=
0x00700161=
0x00700162=
0x00700163=
0x00700164=
0x00700165=
0x00700166=
0x00700167=
0x00700168=
0x00700169=
0x0070016A=
0x0070016B=
0x0070016C=
0x0070016D=
0x0070016E=
0x0070016F=
0x00700170=
0x00700171=
0x00700172=
0x00700173=
0x00700174=
0x00700175=
0x00700176=
0x00700177=
0x00700178=
0x00700179=
0x0070017A=
0x0070017B=
0x0070017C=
0x0070017D=
0x0070017E=
0x0070017F=

/*15 UD数据类错误*/  
0x00800000=UD数据类错误
0x00800001=UD数据缓冲区溢出
0x00800002=MAC缓冲区溢出
0x00800003=UD数据长度溢出
0x00800004=未知UD生成类型
0x00800100=
0x00800101=
0x00800102=
0x00800103=
0x00800104=
0x00800105=
0x00800106=
0x00800107=
0x00800108=
0x00800109=
0x0080010A=
0x0080010B=
0x0080010C=
0x0080010D=
0x0080010E=
0x0080010F=
0x00800110=
0x00800111=
0x00800112=
0x00800113=
0x00800114=
0x00800115=
0x00800116=
0x00800117=
0x00800118=
0x00800119=
0x0080011A=
0x0080011B=
0x0080011C=
0x0080011D=
0x0080011E=
0x0080011F=
0x00800120=
0x00800121=
0x00800122=
0x00800123=
0x00800124=
0x00800125=
0x00800126=
0x00800127=
0x00800128=
0x00800129=
0x0080012A=
0x0080012B=
0x0080012C=
0x0080012D=
0x0080012E=
0x0080012F=
0x00800130=
0x00800131=
0x00800132=
0x00800133=
0x00800134=
0x00800135=
0x00800136=
0x00800137=
0x00800138=
0x00800139=
0x0080013A=
0x0080013B=
0x0080013C=
0x0080013D=
0x0080013E=
0x0080013F=
0x00800140=
0x00800141=
0x00800142=
0x00800143=
0x00800144=
0x00800145=
0x00800146=
0x00800147=
0x00800148=
0x00800149=
0x0080014A=
0x0080014B=
0x0080014C=
0x0080014D=
0x0080014E=
0x0080014F=
0x00800150=
0x00800151=
0x00800152=
0x00800153=
0x00800154=
0x00800155=
0x00800156=
0x00800157=
0x00800158=
0x00800159=
0x0080015A=
0x0080015B=
0x0080015C=
0x0080015D=
0x0080015E=
0x0080015F=
0x00800160=
0x00800161=
0x00800162=
0x00800163=
0x00800164=
0x00800165=
0x00800166=
0x00800167=
0x00800168=
0x00800169=
0x0080016A=
0x0080016B=
0x0080016C=
0x0080016D=
0x0080016E=
0x0080016F=
0x00800170=
0x00800171=
0x00800172=
0x00800173=
0x00800174=
0x00800175=
0x00800176=
0x00800177=
0x00800178=
0x00800179=
0x0080017A=
0x0080017B=
0x0080017C=
0x0080017D=
0x0080017E=
0x0080017F=
    
/*16 硬件类错误*/       
0x00900000=硬件类错误
0x00900001=NandFlash异常
0x00900002=NorFlash异常
0x00900003=SDRAM异常
0x00900004=RC531异常
0x00900005=RTC异常
0x00900100=
0x00900101=
0x00900102=
0x00900103=
0x00900104=
0x00900105=
0x00900106=
0x00900107=
0x00900108=
0x00900109=
0x0090010A=
0x0090010B=
0x0090010C=
0x0090010D=
0x0090010E=
0x0090010F=
0x00900110=
0x00900111=
0x00900112=
0x00900113=
0x00900114=
0x00900115=
0x00900116=
0x00900117=
0x00900118=
0x00900119=
0x0090011A=
0x0090011B=
0x0090011C=
0x0090011D=
0x0090011E=
0x0090011F=
0x00900120=
0x00900121=
0x00900122=
0x00900123=
0x00900124=
0x00900125=
0x00900126=
0x00900127=
0x00900128=
0x00900129=
0x0090012A=
0x0090012B=
0x0090012C=
0x0090012D=
0x0090012E=
0x0090012F=
0x00900130=
0x00900131=
0x00900132=
0x00900133=
0x00900134=
0x00900135=
0x00900136=
0x00900137=
0x00900138=
0x00900139=
0x0090013A=
0x0090013B=
0x0090013C=
0x0090013D=
0x0090013E=
0x0090013F=
0x00900140=
0x00900141=
0x00900142=
0x00900143=
0x00900144=
0x00900145=
0x00900146=
0x00900147=
0x00900148=
0x00900149=
0x0090014A=
0x0090014B=
0x0090014C=
0x0090014D=
0x0090014E=
0x0090014F=
0x00900150=
0x00900151=
0x00900152=
0x00900153=
0x00900154=
0x00900155=
0x00900156=
0x00900157=
0x00900158=
0x00900159=
0x0090015A=
0x0090015B=
0x0090015C=
0x0090015D=
0x0090015E=
0x0090015F=
0x00900160=
0x00900161=
0x00900162=
0x00900163=
0x00900164=
0x00900165=
0x00900166=
0x00900167=
0x00900168=
0x00900169=
0x0090016A=
0x0090016B=
0x0090016C=
0x0090016D=
0x0090016E=
0x0090016F=
0x00900170=
0x00900171=
0x00900172=
0x00900173=
0x00900174=
0x00900175=
0x00900176=
0x00900177=
0x00900178=
0x00900179=
0x0090017A=
0x0090017B=
0x0090017C=
0x0090017D=
0x0090017E=
0x0090017F=

/*17 状态机类错误*/  
0x00070000 =状态机类错误
0x00070001 =状态机类错误
0x00070100=
0x00070101=
0x00070102=
0x00070103=
0x00070104=
0x00070105=
0x00070106=
0x00070107=
0x00070108=
0x00070109=
0x0007010A=
0x0007010B=
0x0007010C=
0x0007010D=
0x0007010E=
0x0007010F=
0x00070110=
0x00070111=
0x00070112=
0x00070113=
0x00070114=
0x00070115=
0x00070116=
0x00070117=
0x00070118=
0x00070119=
0x0007011A=
0x0007011B=
0x0007011C=
0x0007011D=
0x0007011E=
0x0007011F=
0x00070120=
0x00070121=
0x00070122=
0x00070123=
0x00070124=
0x00070125=
0x00070126=
0x00070127=
0x00070128=
0x00070129=
0x0007012A=
0x0007012B=
0x0007012C=
0x0007012D=
0x0007012E=
0x0007012F=
0x00070130=
0x00070131=
0x00070132=
0x00070133=
0x00070134=
0x00070135=
0x00070136=
0x00070137=
0x00070138=
0x00070139=
0x0007013A=
0x0007013B=
0x0007013C=
0x0007013D=
0x0007013E=
0x0007013F=

/*18 锁卡操作类*/
0x00010000=锁卡操作类
0x00010001=
0x00010002=
0x00010003=
0x00010004=
0x00010005=
0x00010006=
0x00010007=
0x00010008=

0x00010100=
0x00010101=
0x00010102=
0x00010103=
0x00010104=
0x00010105=
0x00010106=
0x00010107=
0x00010108=
0x00010109=
0x0001010A=
0x0001010B=
0x0001010C=
0x0001010D=
0x0001010E=
0x0001010F=
0x00010110=
0x00010111=
0x00010112=
0x00010113=
0x00010114=
0x00010115=
0x00010116=
0x00010117=
0x00010118=
0x00010119=
0x0001011A=
0x0001011B=
0x0001011C=
0x0001011D=
0x0001011E=
0x0001011F=
0x00010120=
0x00010121=
0x00010122=
0x00010123=
0x00010124=
0x00010125=
0x00010126=
0x00010127=
0x00010128=
0x00010129=
0x0001012A=
0x0001012B=
0x0001012C=
0x0001012D=
0x0001012E=
0x0001012F=
0x00010130=
0x00010131=
0x00010132=
0x00010133=
0x00010134=
0x00010135=
0x00010136=
0x00010137=
0x00010138=
0x00010139=
0x0001013A=
0x0001013B=
0x0001013C=
0x0001013D=
0x0001013E=
0x0001013F=
0x00010140=
0x00010141=
0x00010142=
0x00010143=
0x00010144=
0x00010145=
0x00010146=
0x00010147=
0x00010148=
0x00010149=
0x0001014A=
0x0001014B=
0x0001014C=
0x0001014D=
0x0001014E=
0x0001014F=
0x00010150=
0x00010151=
0x00010152=
0x00010153=
0x00010154=
0x00010155=
0x00010156=
0x00010157=
0x00010158=
0x00010159=
0x0001015A=
0x0001015B=
0x0001015C=
0x0001015D=
0x0001015E=
0x0001015F=
0x00010160=
0x00010161=
0x00010162=
0x00010163=
0x00010164=
0x00010165=
0x00010166=
0x00010167=
0x00010168=
0x00010169=
0x0001016A=
0x0001016B=
0x0001016C=
0x0001016D=
0x0001016E=
0x0001016F=
0x00010170=
0x00010171=
0x00010172=
0x00010173=
0x00010174=
0x00010175=
0x00010176=
0x00010177=
0x00010178=
0x00010179=
0x0001017A=
0x0001017B=
0x0001017C=
0x0001017D=
0x0001017E=
0x0001017F=

/*19 未归类错误（指不能归类到上述几类错误中的错误。比如可能出现的堆申请失败等）*/
0x00f00000=硬件类错误
0x00f00001=程序下载异常
0x00f00002=程序更新异常
0x00f00003=TPU状态异常
0x00f00004=LED控制命令错误
0x00f00005=蜂鸣器控制命令错误
0x00f00006=
0x00f00007=
0x00f00008=
0x00f00009=
0x00f0000a=
0x00f0000B=蜂鸣器控制命令错误
0x00f0000C=
0x00f0000D=程序大小超过FLASH最大容量
0x00f0000E=
0x00f0000F=
0x00f00010=
0x00f00020=
0x00f00021=
0x00f00022=
0x00f00023=
0x00f00024=
0x00f00025=
0x00f00026=
0x00f00027=
0x00f00028=
0x00f00029=
0x00f00031=
0x00f00032=
0x00f00033=
0x00f00034=
0x00f00035=
0x00f00036=
0x00f00037=
0x00f00038=
0x00F00100=未取UD标记补票失败
0x00F00101=ACC卡在黑名单列表中，建议锁卡
0x00F00102=锁卡指令条件不满足
0x00F00103=应用程序下载时数据包ID不正确
0x00F00104=一卡通授权操作标示错误
0x00F00105=一卡通卡在黑名单列表中，建议锁卡
0x00F00106=设置TPU一卡通签到授权额度失败
0x00F00107=读TPU一卡通审计数据失败
0x00F00108=TPU内授权额度余额将尽或授权截至时间到期
0x00F00109=SAM卡号不一致
0x00F0010A=日期、时间格式不合法
0x00F0010B=读或写地址非法
0x00F0010C=更新授权信息块标志失败
0x00F0010D=更新授权信息块
0x00F0010E=获取审计数据时地址非法
0x00F0010F=读取审计数据内容失败
0x00F00110=擦出授权信息块失败
0x00F00111=擦除块信息失败
0x00F00112=
0x00F00113=
0x00F00114=RESET失败 
0x00F00115=
0x00F00116=
0x00F00117=
0x00F00118=
0x00F00119=
0x00F0011A=
0x00F0011B=
0x00F0011C=
0x00F0011D=
0x00F0011E=
0x00F0011F=
0x00F00120=
0x00F00121=
0x00F00122=
0x00F00123=
0x00F00124=
0x00F00125=
0x00F00126=
0x00F00127=
0x00F00128=
0x00F00129=
0x00F0012A=
0x00F0012B=
0x00F0012C=
0x00F0012D=
0x00F0012E=
0x00F0012F=
0x00F00130=
0x00F00131=
0x00F00132=
0x00F00133=
0x00F00134=
0x00F00135=
0x00F00136=
0x00F00137=
0x00F00138=
0x00F00139=
0x00F0013A=
0x00F0013B=
0x00F0013C=
0x00F0013D=
0x00F0013E=
0x00F0013F=
0x00F00140=
0x00F00141=
0x00F00142=
0x00F00143=
0x00F00144=
0x00F00145=
0x00F00146=
0x00F00147=
0x00F00148=
0x00F00149=
0x00F0014A=
0x00F0014B=
0x00F0014C=
0x00F0014D=
0x00F0014E=
0x00F0014F=
0x00F00150=
0x00F00151=
0x00F00152=
0x00F00153=
0x00F00154=
0x00F00155=
0x00F00156=
0x00F00157=
0x00F00158=
0x00F00159=
0x00F0015A=
0x00F0015B=
0x00F0015C=
0x00F0015D=
0x00F0015E=
0x00F0015F=
0x00F00160=
0x00F00161=
0x00F00162=
0x00F00163=
0x00F00164=
0x00F00165=
0x00F00166=
0x00F00167=
0x00F00168=
0x00F00169=
0x00F0016A=
0x00F0016B=
0x00F0016C=
0x00F0016D=
0x00F0016E=
0x00F0016F=
0x00F00170=
0x00F00171=
0x00F00172=
0x00F00173=
0x00F00174=
0x00F00175=
0x00F00176=
0x00F00177=
0x00F00178=
0x00F00179=
0x00F0017A=
0x00F0017B=
0x00F0017C=
0x00F0017D=
0x00F0017E=
0x00F0017F=

/*20 钱包加值异常*/
0x00B10000=卡片加值操作未完成，请重新刷卡。
0x00B20000=卡片加值操作未完成，不是同一张卡，请重新刷卡。

/*21 参数类错误*/
0x00090000=参数类错误
0x00090001=0101参数文件不存在
0x00090002=0102参数文件不存在
0x00090003=0103参数文件不存在
0x00090004=0201参数文件不存在
0x00090005=0301参数文件不存在
0x00090006=0302参数文件不存在
0x00090007=0401参数文件不存在
0x00090008=0601参数文件不存在
0x00090009=0602参数文件不存在
0x0009000A=0603参数文件不存在
0x0009000B=0604参数文件不存在
0x0009000C=0605参数文件不存在
0x0009000D=0606参数文件不存在
0x0009000E=0607参数文件不存在
0x0009000F=0608参数文件不存在
0x00090011=0701参数文件不存在
0x00090012=0702参数文件不存在
0x00090013=0801参数文件不存在
0x00090014=0802参数文件不存在
0x00090015=1002参数文件不存在
0x00090016=0101参数文件初始化失败
0x00090017=0102参数文件初始化失败
0x00090018=0103参数文件初始化失败
0x00090019=0201参数文件初始化失败
0x0009001A=0301参数文件初始化失败
0x0009001B=0302参数文件初始化失败
0x0009001C=0401参数文件初始化失败
0x0009001D=0601参数文件初始化失败
0x0009001E=0602参数文件初始化失败
0x0009001F=0603参数文件初始化失败
0x00090020=0604参数文件初始化失败
0x00090021=0605参数文件初始化失败
0x00090022=0606参数文件初始化失败
0x00090023=0607参数文件初始化失败
0x00090024=0608参数文件初始化失败
0x00090025=0701参数文件初始化失败
0x00090026=0702参数文件初始化失败
0x00090027=0801参数文件初始化失败
0x00090028=0802参数文件初始化失败
0x00090029=1002参数文件初始化失败
0x0009002A=0102参数文件没有查找到匹配项，此项行政处理类型找不到对应的手续费
0x0009002B=0103参数文件没有查找到匹配项，当前的超时时间找不到对应的补交金额
0x0009002C=参数文件中没有找到内有效的站点
0x0009002D=0302参数文件没有查找到匹配项，预留
0x0009002E=0401参数文件没有查找到匹配项，当前卡不是系统内有效的卡
0x0009002F=0601参数文件没有查找到匹配项，计算票价时查不到费率等级
0x00090030=0602参数文件没有查找到匹配项，计算票价时查不到基础票价
0x00090031=0604参数文件没有查找到匹配项，预留
0x00090032=0605参数文件没有查找到匹配项，预留
0x00090033=0606参数文件没有查找到匹配项，预留
0x00090034=0607参数文件没有查找到匹配项，预留
0x00090035=0801参数文件没有查找到匹配项，此异地卡不在白名单列表中
0x00090036=0802参数文件没有查找到匹配项，此异地卡无法找到对应的车票子类型
0x00090037=指定的进站站点或出站站点没有找到最大或者最小的票价
0x00090038=0303参数文件不存在
0x00090039=0303参数文件没有查找到匹配项，当前区段编码不是有效的区段
